#+TITLE: tbx (toolbox) for productivity in information processing

** Not able to view *.mov file on Ubuntu with VLC and totem: alternative solution: use mplayer

For VLC, here is the error message:
as of[2017-11-21 Tue 09:59]
#+BEGIN_EXAMPLE
  Failed to open VDPAU backend libvdpau_nvidia.so: cannot open shared object file: No such file or directory
#+END_EXAMPLE

Following the suggestion from https://askubuntu.com/questions/13487/gnome-mplayer-failed-to-open-vdpau-backend-libvdpau-nvidia-so-error
did not work, as it suggested to add:

The following with sudo would not evaluate with C-c C-c
#+BEGIN_SRC shell
  sudo ln -s /usr/lib/vdpau/libvdpau_nvidia.so.1 /usr/lib/libvdpau_nvidia.so
#+END_SRC

#+RESULTS:
: /home/yubrshen/programming/tbx-augmented-human-intelligence
: 1

The following is the way to execute commands
"Evaluation of this shell code block is disabled" emacs babel with sudo in babel:
#+NAME:
#+BEGIN_SRC emacs-lisp
  (let ((default-directory "/sudo::"))
    (shell-command "ln -s /usr/lib/vdpau/libvdpau_nvidia.so.1 /usr/lib/libvdpau_nvidia.so"))
#+END_SRC

But I checked the file/link has aleardy existed:

#+BEGIN_SRC shell
Pybites.  ls -lt /usr/lib/vdpau/libvdpau_nvidia.so.1
#+END_SRC

#+RESULTS:
: lrwxrwxrwx 1 root root 55 Nov  4 12:59 /usr/lib/vdpau/libvdpau_nvidia.so.1 -> /etc/alternatives/x86_64-linux-gnu_libvdpau_nvidia.so.1

I chased the symbolic link:

#+BEGIN_SRC shell
ls -lt /etc/alternatives/x86_64-linux-gnu_libvdpau_nvidia.so.1
ls -lt /usr/lib/nvidia-384/vdpau/libvdpau_nvidia.so.1
#+END_SRC

#+RESULTS:
| lrwxrwxrwx | 1 | root | root | 46 | Nov | 4 | 12:59 | /etc/alternatives/x86_64-linux-gnu_libvdpau_nvidia.so.1 | -> | /usr/lib/nvidia-384/vdpau/libvdpau_nvidia.so.1 |
| lrwxrwxrwx | 1 | root | root | 25 | Nov | 2 | 12:42 | /usr/lib/nvidia-384/vdpau/libvdpau_nvidia.so.1          | -> | libvdpau_nvidia.so.384.98                      |

#+BEGIN_SRC shell
ls -lt /usr/lib/nvidia-384/vdpau/libvdpau_nvidia.so.384.98
#+END_SRC

#+RESULTS:
: -rw-r--r-- 1 root root 888288 Oct 26 14:40 /usr/lib/nvidia-384/vdpau/libvdpau_nvidia.so.384.98

so at the end of the symbolic link, the target file did exist!

But vlc still complainted.

The problem with totem is simply just crash.

The alternative of using mplayer to view the same file worked. So the case is closed for now,[2017-11-21 Tue 10:23]


**** Find files by extension, or type

   The following snippet works, but it took a long time. Amazingly long.
   Outside of emacs, it took much shorter time.

   #+BEGIN_SRC shell
   find /media/yubrshen/DATA/ai-study -regex ".*\.\(mm\)"
   #+END_SRC

   #+RESULTS:
   | /media/yubrshen/DATA/ai-study/ASimpleNeuralNetworkModuleForRelat.mm                                                             |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/elastic-weight-consolidation/ElasticWeightConsolidation.mm                                        |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/machine-learning-top-level.mm                                                                     |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/Key-Concepts-for-Term-One-of-SDC-ND.mm                                                        |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/session-leader/DevelopmentForUdacitySessionLeader.mm                                          |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/session-leader/FindingStraightLane.mm                                                         |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/CarND-Vehicle-Detection/Notes                                                          | on | Project | of                | Vehicle  | Detection  | and | Tracking.mm |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/CarND-behavior-cloning/Notes                                                           | on | project | of                | behavior | cloning.mm |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/CarND-Traffic-Sign-Classifier-Project/TrafficSignClassificationProject.mm              |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/SDC-term-1-notes.mm                                                                    |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/SystematicEvaluationOfCNNAdvancesOn.mm                                                 |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-1/vehicle-surrounding/To-brain-storms.mm                                                 |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term-2/notes-course/Key-concepts-SDC-term-2.mm                                                |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term3/notes/scratch.mm                                                                        |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term3/projects/Capstone-Study/Clarification                                                   | of | stop    | considerations.mm |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term3/projects/CarND-Capstone/clarify-stop-scenario-algorithm.mm                              |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term3/projects/CarND-Path-Planning-Project/Development-of-congestion-model-in-traffic-lane.mm |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/sdc/term3/projects/ROS_pratcice/ROS-notes.mm                                                      |    |         |                   |          |            |     |             |
   | /media/yubrshen/DATA/ai-study/ShenzhenTransportProjectStudy.mm                                                                  |    |         |                   |          |            |     |             |


*** cd - change to previous directory

#+BEGIN_SRC shell
pwd
cd ~/tmp
pwd
cd - # expect to /home/yubrshen/programming/tbx-augmented-human-intelligence
cd - # expect to ~/tmp
#+END_SRC

#+RESULTS:
| /home/yubrshen/programming/tbx-augmented-human-intelligence |
| /home/yubrshen/tmp                                          |
| /home/yubrshen/programming/tbx-augmented-human-intelligence |
| /home/yubrshen/tmp                                          |

*** cd ~- and cd ~+

~- as a general expression for the previous directory
~+ as the current directory

#+BEGIN_SRC shell
  echo ~+                         # equivalent to pwd: /home/yubrshen/programming/tbx-augmented-human-intelligence
  cd ~/tmp
  echo ~-                         # show the previous directory: /home/yubrshen/programming/tbx-augmented-human-intelligence
  echo ~+                         # pwd: /home/yubrshen/tmp
  cd /tmp
  echo ~+                         # pwd: /tmp
  echo ~- # previous directory: /home/yubrshen/tmp
#+END_SRC

#+RESULTS:
| /home/yubrshen/programming/tbx-augmented-human-intelligence |
| /home/yubrshen/programming/tbx-augmented-human-intelligence |
| /home/yubrshen/tmp                                          |
| /tmp                                                        |
| /home/yubrshen/tmp                                          |

*** Meaning of && in shell commands

Continue, sequential execution

#+BEGIN_SRC shell
echo "Wish you" && echo " Happy New Year!"
#+END_SRC

#+RESULTS:
| Wish  | you |       |
| Happy | New | Year! |

*** Putting command outcome to an variable

#+BEGIN_SRC shell
  date=`date`
  echo $date
#+END_SRC

#+RESULTS:
: Sat Dec 30 15:39:30 PST 2017

The same as above to collect output of command:
#+BEGIN_SRC shell
data="$(date)"
echo $data
#+END_SRC

#+RESULTS:
: Sat Dec 30 18:04:25 PST 2017

Create a test script to show the meaning of $0
$0 is the full path of the script.

#+BEGIN_SRC shell
echo 'echo "here is the  full path of script: " "$0"  ' > ~/tmp/tmp.sh
echo 'echo "and here is the folder of the script: " "$(dirname "$0")"' >> ~/tmp/tmp.sh
chmod u+x ~/tmp/tmp.sh
~/tmp/tmp.sh
#+END_SRC

#+RESULTS:
| here | is   | the | full | path   | of | script: | /home/yubrshen/tmp/tmp.sh |                    |
| and  | here | is  | the  | folder | of | the     | script:                   | /home/yubrshen/tmp |

Putting the pieces together:

1. Extract the folder of the path.
#+BEGIN_SRC shell
A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
echo $A_FULL_PATH
THIS_DIR="$(dirname $A_FULL_PATH)"
echo $THIS_DIR
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh |
| /home/yubrshen/tmp        |

2. Use the extracted folder to change into that folder.
#+BEGIN_SRC shell
A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
echo $A_FULL_PATH
THIS_DIR="$(cd "$(dirname $A_FULL_PATH)")"
echo "THIS_DIR: " $THIS_DIR
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh |
| THIS_DIR:                 |

1. Then capture the folder path from pwd -P
This would provide the absolute path throug pwd -P, but "$(dirname "$0")" would only provide the relative path
#+BEGIN_SRC shell
A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
echo $A_FULL_PATH
THIS_DIR="$(cd "$(dirname $A_FULL_PATH)" && pwd -P)"
echo "THIS_DIR: " $THIS_DIR
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh |                    |
| THIS_DIR:                 | /home/yubrshen/tmp |

4. Then change back to the previous folder before changing into the folder.
#+BEGIN_SRC shell
A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
echo $A_FULL_PATH
THIS_DIR="$(cd "$(dirname $A_FULL_PATH)" && pwd -P && cd - > /dev/null)"
echo "THIS_DIR: " $THIS_DIR
pwd
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh                                   |                    |
| THIS_DIR:                                                   | /home/yubrshen/tmp |
| /home/yubrshen/programming/tbx-augmented-human-intelligence |                    |

5. Use the captured folder name to construct a file path
#+BEGIN_SRC shell
A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
echo $A_FULL_PATH
THIS_DIR="$(cd "$(dirname $A_FULL_PATH)" && pwd -P && cd - > /dev/null)"
echo "THIS_DIR: " $THIS_DIR
USER_PROFILE="$THIS_DIR/profile.tmp"
echo $USER_PROFILE
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh      |                    |
| THIS_DIR:                      | /home/yubrshen/tmp |
| /home/yubrshen/tmp/profile.tmp |                    |

6. Check the existence of the file

#+BEGIN_SRC shell
  A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
  echo $A_FULL_PATH
  THIS_DIR="$(cd "$(dirname $A_FULL_PATH)" && pwd -P && cd - > /dev/null)"
  echo "THIS_DIR: " $THIS_DIR
  USER_PROFILE="$THIS_DIR/profile.tmp"
  echo $USER_PROFILE
  if [ ! -f "$USER_PROFILE" ];
     then
     echo "What is the full path to your Unity simulator?"
  fi
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh      |                    |     |      |      |    |      |       |            |
| THIS_DIR:                      | /home/yubrshen/tmp |     |      |      |    |      |       |            |
| /home/yubrshen/tmp/profile.tmp |                    |     |      |      |    |      |       |            |
| What                           | is                 | the | full | path | to | your | Unity | simulator? |

7. Read from terminal from user input
#+BEGIN_SRC shell
  A_FULL_PATH="/home/yubrshen/tmp/tmp.sh"
  echo $A_FULL_PATH
  THIS_DIR="$(cd "$(dirname $A_FULL_PATH)" && pwd -P && cd - > /dev/null)"
  echo "THIS_DIR: " $THIS_DIR
  USER_PROFILE="$THIS_DIR/profile.tmp"
  echo $USER_PROFILE
  if [ ! -f "$USER_PROFILE" ];
     then
     echo "What is the full path to your Unity simulator?"
     read unity_path
     echo $unity_path
  fi
#+END_SRC

#+RESULTS:
| /home/yubrshen/tmp/tmp.sh      |                    |     |      |      |    |      |       |            |
| THIS_DIR:                      | /home/yubrshen/tmp |     |      |      |    |      |       |            |
| /home/yubrshen/tmp/profile.tmp |                    |     |      |      |    |      |       |            |
| What                           | is                 | the | full | path | to | your | Unity | simulator? |
|                                |                    |     |      |      |    |      |       |            |

As I don't know how to execute the shell with input, the following script needs to be executed at a terminal prompt to test.

#+BEGIN_SRC shell
  echo 'echo "Please input your name:"' > ~/tmp/prompt-input-tmp.sh
  echo 'read name' >> ~/tmp/prompt-input-tmp.sh
  echo 'echo $name' >> ~/tmp/prompt-input-tmp.sh
  chmod u+x ~/tmp/prompt-input-tmp.sh
  ls -lt ~/tmp/prompt-input-tmp.sh
  # cat ~/tmp/prompt-input-tmp.sh
  script=$(cat ~/tmp/prompt-input-tmp.sh)
  echo $script
#+END_SRC

#+RESULTS:

By executing the generated the script, here is the trace of the execution:

#+BEGIN_QUOTE
$ ~/tmp/prompt-input-tmp.sh
Please input your name:
Jonah
Jonah
#+END_QUOTE

Get one line of content from a file to a variable

#+BEGIN_SRC shell
  script=$(cat ~/tmp/prompt-input-tmp.sh)
  echo $script
#+END_SRC

#+RESULTS:
: Please input your name:

*** bash: the last argument of the previous command !$

 #+BEGIN_SRC shell
#!/usr/bash
echo "Hello"
echo !$
 #+END_SRC

 #+RESULTS:
 | Hello |
 | !$    |


**** A real successful one

 With emacs, use ,, as the escape key
 #+NAME:keychord-escape
 #+BEGIN_SRC emacs-lisp
 (evil-escape-mode)
 (setq-default evil-escape-key-sequence ",,")
 (setq-default evil-escape-delay 0.3) ; the suggested is 0.2, but to me it's still not enough delay, 0.3 seems better.
 #+END_SRC

 #+RESULTS: keychord-escape
 : 0.3

 ;; The delay between the two key presses can be customized with the variable evil-escape-delay. The default value is 0.1. If your key sequence is composed with the two same characters it is recommended to set the delay to 0.2.

 Note, it only works after a space ' '

** Upgrade freeplane

 After downloading the latest from https://sourceforge.net/projects/freeplane/files/latest/download
 #+BEGIN_SRC shell
   cd ~/bin
   rm freeplane.sh
   ln -s freeplane-1.6.12/freeplane.sh freeplane.sh
 #+END_SRC

 #+RESULTS:

 The version of freeplane-1.6.10 has a problem of latex editor, with misplacement of cursor, when editing node with \latex format.
 The problem is with 1.6.3, .7, 10, 11. The work-around is to edit without \latex first, then after completion, add \latex

 #+RESULTS:

 Verify the update:
 #+BEGIN_SRC shell
 ls -lt ~/bin/freeplane.sh
 #+END_SRC

 #+RESULTS:
 : lrwxrwxrwx 1 yubrshen yubrshen 28 Nov 22 21:02 /home/yubrshen/bin/freeplane.sh -> freeplane-1.6.3/freeplane.sh

** Keyboard improvement

 The problems:

 - Esc key is too far away, not convenient to access. With spacemacs,
 it's used very often. Binding it to ,, works most of the time, but not always.
 (It's a minor problem with ,, bound for esc.)

 - Control key on the left is not convenient to access. It's no longer possible to ctrl-x with one hand with Dvorak keyboard.
 (A potential solution is to use palm to press it.)

 Potential solutions:

 - Esc:
   - bound to CAPSLOCKS
   - bind shift-CAPSLOCKS for CAPSLOCKS
   - bound to ,,
   - bind control to esc

 - Control key
   - use palm to press it
   - use xcape to bind to long press CAPSLOCKS for left control key
   - use xcape to bind to long press Enter for the right control key
   - bind esc to control key

 Map CAPSLOCKS to control and escape both:

 http://tiborsimko.org/capslock-escape-control.html

 #+BEGIN_SRC shell
 # make CapsLock behave like Ctrl:
 setxkbmap -option ctrl:nocaps

 # make short-pressed Ctrl behave like Escape:
 xcape -e 'Control_L=Escape'
 #+END_SRC

 #+RESULTS:

 Troubleshooting
 If the CapsLock key gets "stuck" and produces say uppercase letter combinations instead of lowercase ones,
 the easiest way to remove xcape mapping is to revert CapsLock key function via xmodmap:

 #+BEGIN_SRC shell0
 xmodmap -e 'keycode 0x42 = Caps_Lock'
 #+END_SRC
 followed by re-running of the keyboard modification script.

 More elaborate configuration example:

 #+BEGIN_SRC shell
 # set internal keyboard layout:
 deviceid=$(xinput -list | grep 'AT .* keyboard' | head -1 | grep -oE 'id=[0-9]+' | sed 's/id=//g')
 if [ "${deviceid}" != "" ]; then
     setxkbmap -device "${deviceid}" dvorak
     setxkbmap -device "${deviceid}" -option ctrl:nocaps # make CapsLock behave like Ctrl
 fi

 # set Kinesis keyboard layout:
 for deviceid in $(xinput -list | grep ' HID ' | grep -oE 'id=[0-9]+' | sed 's/id=//g'); do
     if [ "${deviceid}" != "" ]; then
         setxkbmap -device "${deviceid}" us # 'us' but it means 'dvorak' actually due to Kinesis
         setxkbmap -device "${deviceid}" -option ctrl:nocaps # make CapsLock behave like Ctrl
     fi
 done
 #+END_SRC

 #+BEGIN_SRC shell
 deviceid=$(xinput -list | grep 'AT .* keyboard' | head -1 | grep -oE 'id=[0-9]+' | sed 's/id=//g')
 echo $deviceid

 #+END_SRC

 #+RESULTS:
 : 15

IT seems that $variable and ${variable} are equivalent.

#+BEGIN_SRC shell
id=15
echo "Here is id: " $id "and id again: " ${id}
#+END_SRC

#+RESULTS:
: Here is id:  15 and id again:  15

There seems a problem that the keyboard setup by setxkbmap might be lost after suspend.
It's confirmed on the Internet, but no apparent solution has been found.

Let me monitor if the problem happen again.

** Be careful when executing code block not seeing error nor outcome in org-modern_emacs

With a code block with a name, the output results is append to the result section for the
same name. If there is duplicated name for another code block, the result will be
stacked together. If the result section is elsewhere in the file, it might appear that
the same named code does not produce output.

For example,

#+NAME:block-A
#+BEGIN_SRC emacs-lisp
(+ 1 2)
#+END_SRC

#+RESULTS: block-A
: HelloWorld!
: 3

#+NAME:block-A
#+BEGIN_SRC emacs-lisp
(concat "Hello" "World!")
#+END_SRC

This might be a way to compose text using code block!

** To be able to access all tables in different database in a database server?

The table name must be fully qualified with database name, schema name and
table name to let the statement block work. For example,

#+NAME:using-properties
#+BEGIN_SRC sql :noweb no-export :tangle
select * from OtherDW.dbo.Supplier_D
#+END_SRC

#+RESULTS: using-properties
| Supplier_Id | Supplier_Name |
|-------------+---------------|
|           1 | Walmart       |
|           2 | Amazon        |


** to execute SQL code block org-mode (literate DBMS) with Mircorsoft SQL Server on Ubuntu

Here is an good example of literate DBMS:
http://www.howardism.org/Technical/Emacs/literate-database.html

So far to to be execut SQL block in org-mode with Microsoft SQL Server,
the header arguments must be explicitly placed at the header of an SQL block.
(Defining them as properties doesn't work! It is supposed to work per
https://www.gnu.org/software/emacs/manual/html_node/org/Header-arguments-in-Org-mode-properties.html
)

#+NAME:test
#+BEGIN_SRC sql :noweb no-export :tangle :engine mssql :cmdline "-S localhost -U SA -P 27Wangzi15"
select * from [DWPractice].[dbo].[Sales_F]
#+END_SRC

#+RESULTS: test
| City_id | Prod_id |      Month | Customer_Id | Supplier_Id | Units | Dollars |
|---------+---------+------------+-------------+-------------+-------+---------|
|       1 |     288 | 2008-01-01 |           3 |           1 |     4 |  7.3200 |
|       1 |     288 | 2008-02-01 |           1 |           1 |    16 | 42.4000 |
|       1 |     589 | 2008-01-01 |           1 |           2 |     3 |  7.9500 |
|       2 |     288 | 2008-01-01 |           2 |           2 |     4 |  7.3200 |
|       2 |     589 | 2008-01-01 |           2 |           1 |     3 |  7.9500 |

#+NAME:test-1
#+BEGIN_SRC sql :noweb no-export :tangle :engine mssql :cmdline "-S localhost -U SA -P 27Wangzi15"
select * from OtherDW.dbo.Supplier_D
#+END_SRC

#+RESULTS: test-1
| Supplier_Id | Supplier_Name |
|-------------+---------------|
|           1 | Walmart       |
|           2 | Amazon        |


